pkg/workflow/node/salesforce/metaSoap.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <env:Header>
        <urn:SessionHeader xmlns:urn="http://soap.sforce.com/2006/04/metadata">
            <urn:sessionId>{{ .SessionId }}</urn:sessionId>
        </urn:SessionHeader>
    </env:Header>
    <env:Body>
        <createMetadata xmlns="http://soap.sforce.com/2006/04/metadata">
            <metadata xsi:type="RemoteSiteSetting">
                <fullName>{{ .TriggerName }}</fullName>
                <isActive>true</isActive>
                <url>{{ .CallbackUrl }}</url>
            </metadata>
        </createMetadata>
    </env:Body>
</env:Envelope>